Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_system/department_of_health_and_children.html.txt.tmx
Source language: en
Languages: ga

source: The Government, the Minister for Health and the Department of Health are at the head of the health service
ga: Tá an Rialtas, an tAire Sláinte agus an Roinn Sláinte i gceannas ar sholáthar na seirbhísí sláinte

source: The Department's main role is to support the Minister and Ministers of State in the development and implementation of policy for the health services
ga: Is é príomhról na Roinne ná tacú leis an Aire agus leis an Aire Stáit chun beartais do na seirbhísí sláinte a fhorbairt agus a chur i bhfeidhm

source: It also monitors the performance of health services
ga: Anuas air sin, déanann siad monatóireacht ar fheidhmíocht na seirbhísí sláinte

source: Health services are delivered by the Health Service Executive (HSE)
ga: Chomh maith leis sin, soláthraíonn Feidhmeannacht na Seirbhíse Sláinte (FSS) seirbhísí sláinte

source: The Minister for Health has overall constitutional and political responsibility for the Department
ga: Tá freagracht fhoriomlán bhunreachtúil agus pholaitiúil ar an Aire Sláinte as an Roinn

source: There are 4 Ministers of State assigned to the Department with responsibility for: • Disabilities
ga: Is é an tArd-Rúnaí ceannasaí (Státseirbhíse) riaracháin na Roinne

source: • Communities and the National Drugs Strategy
ga: Is é/í “an t-oifigeach cuntasaíochta”

source: He or she is the "accounting officer". In other words, he or she is responsible to the Dáil for ensuring that the money allocated to the Department is spent in the proper manner
ga: I bhfriotal eile, tá sé nó sí freagrach os comhair na Dála as deimhin a dhéanamh de go gcaitear a t-airgead a leithdháiltear ar an Roinn mar is cuí

source: The Chief Medical Officer advises the Minister, Minister of State, and the Department on medical issues and also has responsibility for patient safety and quality, clinical effectiveness, health protection and promotion, tobacco control policy, health and wellbeing, social inclusion and bioethics
ga: Cuireann an Príomh-Oifigeach Míochaine comhairle ar an Aire, an tAire Stáit, agus ar an Roinn faoi cheisteanna liachta agus tá sé/sí freagrach, chomh maith, as sábháilteacht othair agus cáilíocht, éifeachtacht chliniciúil, cosaint agus cur chun cinn na sláinte, beartas um rialú tobac, sláinte agus folláine, cuimsiú sóisialta agus bitheitic

source: There are a number of divisions within the Department that each have a different policy or administrative function
ga: Is féidir leat níos mó a léamh faoin Roinn Sláinte, an struchtúr eagraíochta, ina measc. Tá roinnt rannán sa Roinn

source: Each division is comprised of a number of units with specific areas of responsibility
ga: Tá roinnt aonad ann i ngach rannán ina bhfuil limistéir shonracha freagrachta
